Terraform Plan:
```data.aws_key_pair.tom: Reading...
data.aws_caller_identity.current: Reading...
aws_iam_policy.certbot_dns_route53: Refreshing state... [id=arn:aws:iam::941133421128:policy/CertbotDNSRoute53]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-06a74ec7f77c3e70d]
aws_acm_certificate._127cyber_wildcard_cert: Refreshing state... [id=arn:aws:acm:ap-southeast-2:941133421128:certificate/8a3fa3f5-d088-40bc-acdd-cbbdf26a3cd6]
data.aws_route53_zone._127cyber-name: Reading...
aws_iam_role.ec2_instance_role: Refreshing state... [id=ec2-instance-role-generic]
aws_vpc.main: Refreshing state... [id=vpc-0dd2fa7e493c2d1d7]
aws_iam_role_policy_attachment.ssm_managed_instance_core: Refreshing state... [id=ec2-instance-role-generic-20240224034341068200000003]
aws_iam_role_policy_attachment.cloudwatch_agent_server_policy: Refreshing state... [id=ec2-instance-role-generic-20240224034341335600000004]
aws_iam_role_policy_attachment.certbot_dns_route53_attachment: Refreshing state... [id=ec2-instance-role-generic-20240224112342775000000001]
aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-instance-profile]
data.aws_caller_identity.current: Read complete after 0s [id=941133421128]
aws_kms_key.siem_key: Refreshing state... [id=ae6f9ce0-7188-4468-9bd9-083b51e7a269]
data.aws_route53_zone._127cyber-name: Read complete after 0s [id=Z03093112GERZ97ION6VA]
data.aws_key_pair.tom: Read complete after 0s [id=key-0cc0ecf0f4e10d006]
aws_route53_record._127cyber_wildcard_cert_validation["*.127cyber.com"]: Refreshing state... [id=Z03093112GERZ97ION6VA__138665dd27ee909427cb33f3f8ce3b81.127cyber.com._CNAME]
aws_acm_certificate_validation._127cyber_wildcard_cert_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_kms_alias.siem_key_alias: Refreshing state... [id=alias/siem_key]
aws_subnet.private2: Refreshing state... [id=subnet-0bb24ce7b57f11a4e]
aws_subnet.public2: Refreshing state... [id=subnet-0e195ef9c3da6dc03]
aws_subnet.public1: Refreshing state... [id=subnet-08bf80caf918933b3]
aws_lb_target_group.tg_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/be94bcbe8c5e46d0]
aws_internet_gateway.gw: Refreshing state... [id=igw-0f2fc9f6ea764fef2]
aws_lb_target_group.tg_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/aed66517d6efb554]
aws_lb_target_group.wazuh_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/37aacca1f487e185]
aws_lb_target_group.tg_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/472cbbfaed15f937]
aws_lb_target_group.tg_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-9200/46b3b4e7fef0563f]
aws_security_group.all: Refreshing state... [id=sg-01d4c90dd2abaa4a5]
aws_subnet.private1: Refreshing state... [id=subnet-0818a00226f9ede92]
aws_route_table.public: Refreshing state... [id=rtb-0e96cd9978cf3b5de]
aws_nat_gateway.nat: Refreshing state... [id=nat-007d6fbfd8cb73c4a]
aws_lb.nlb_wazuh: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/net/wazuh-nlb/b57b44e684040335]
aws_lb.soc_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:loadbalancer/app/soc-alb/7167088de8f11630]
module.ec2_wazuh.aws_instance.this[0]: Refreshing state... [id=i-00cc595c64be87511]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-0e07e41a1de38dcf6]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-0f3c107ed482e0fce]
aws_route_table.private: Refreshing state... [id=rtb-08636ea2b68e2edc0]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-081e0d8387c6bd91e]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-00f8c755f122060ac]
aws_route53_record.wazuh_record: Refreshing state... [id=Z03093112GERZ97ION6VA_wazuh.127cyber.com_A]
aws_lb_listener.https_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/app/soc-alb/7167088de8f11630/2fc9ec04482afd08]
aws_route53_record.nlb_dns: Refreshing state... [id=Z03093112GERZ97ION6VA_listen.127cyber.com_CNAME]
aws_lb_listener.listener_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/6e500a4694cae009]
aws_lb_listener.listener_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/39b91ef407e7718b]
aws_lb_listener.listener_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/5e2779f8e9201356]
aws_lb_listener.listener_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener/net/wazuh-nlb/b57b44e684040335/79207b424e9511e1]
aws_lb_listener_rule.wazuh_subdomain: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:listener-rule/app/soc-alb/7167088de8f11630/2fc9ec04482afd08/e3a4bb15f56c9424]
aws_lb_target_group_attachment.attach_wazuh_1515: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/be94bcbe8c5e46d0-20240229113724706500000005]
aws_lb_target_group_attachment.attach_wazuh_55000: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/aed66517d6efb554-20240229113724482900000004]
aws_lb_target_group_attachment.attach_wazuh_9200: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-9200/46b3b4e7fef0563f-20240229113724453200000003]
aws_lb_target_group_attachment.attach_wazuh_1514: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/472cbbfaed15f937-20240229113724740300000006]
aws_lb_target_group_attachment.wazuh_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/37aacca1f487e185-20240229113724414400000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_target_group_attachment.attach_wazuh_1514 must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach_wazuh_1514" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1514/472cbbfaed15f937-20240229113724740300000006" -> (known after apply)
      ~ target_id        = "i-00cc595c64be87511" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.attach_wazuh_1515 must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach_wazuh_1515" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-1515/be94bcbe8c5e46d0-20240229113724706500000005" -> (known after apply)
      ~ target_id        = "i-00cc595c64be87511" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.attach_wazuh_55000 must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach_wazuh_55000" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-55000/aed66517d6efb554-20240229113724482900000004" -> (known after apply)
      ~ target_id        = "i-00cc595c64be87511" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_lb_target_group_attachment.attach_wazuh_9200 must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach_wazuh_9200" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/tg-9200/46b3b4e7fef0563f-20240229113724453200000003" -> (known after apply)
      ~ port             = 2900 -> 9200 # forces replacement
      ~ target_id        = "i-00cc595c64be87511" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.wazuh_attachment must be replaced
-/+ resource "aws_lb_target_group_attachment" "wazuh_attachment" {
      ~ id               = "arn:aws:elasticloadbalancing:ap-southeast-2:941133421128:targetgroup/wazuh-tg/37aacca1f487e185-20240229113724414400000002" -> (known after apply)
      ~ target_id        = "i-00cc595c64be87511" # forces replacement -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ec2_wazuh.aws_instance.this[0] must be replaced
-/+ resource "aws_instance" "this" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-2:941133421128:instance/i-00cc595c64be87511" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "ap-southeast-2a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-00cc595c64be87511" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0e411623a01bb6363" -> (known after apply)
      ~ private_dns                          = "ip-10-0-3-46.ap-southeast-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.3.46" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "wazuh"
            "Terraform"   = "true"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "17174a939b9137be933820cb146e95a5e94ba849" -> "6c2632ac93620c655803ec428d3dc35d4f329613"
      + user_data_base64                     = (known after apply)
        # (12 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 2 -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 3000 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:ap-southeast-2:941133421128:key/ae6f9ce0-7188-4468-9bd9-083b51e7a269" -> "ae6f9ce0-7188-4468-9bd9-083b51e7a269" # forces replacement
          - tags                  = {} -> null
          ~ throughput            = 125 -> (known after apply)
          ~ volume_id             = "vol-0fa30a4d2d41bc3d5" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```